Revit 2016 API
UIView.ViewId Property
The id of the View associated with a UIView.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public ElementId ViewId { get; }
Visual Basic
Public ReadOnly Property ViewId As ElementId
	Get
Visual C++
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
Return Value
The id of the View.
See Also
UIView Class
Autodesk.Revit.UI Namespace